CNBL/constant/turbulenceProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      turbulenceProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
#include "../setUp" 

simulationType  RAS;

RAS
{
    RASModel kEpsilonABL;
    turbulence on;
    printCoeffs on;
    kEpsilonABLCoeffs
    {
        Cmu         $Cmu; 
        Ceps1	$Ceps1;
        Ceps2	$Ceps2;
        Clambda     $Clambda;
        // unclear Buoyancy related alphaB , Ceps1Star, Ceps3	
        C1          $Ceps1;
        C2          $Ceps2;
        sigmaEps    $sigmaEps;
        sigmak      $sigmak;
        kappa       $kappa;
        //NOTE: See "On the use of the k-Epsilon model in commercial CFD software
        // to model the neutral atmospheric boundary layer". J. of wind engineering
        // and inductrial aerodymanics 95(2007) 355-269 by
        // D.M. Hargreaves and N.G. Wright
        kMin	1e-9;
        epsilonMin	1e-12;
    }
}


// ************************************************************************* //
