CNBL/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include "../setUp"

dimensions      [ 0 1 -1 0 0 0 0 ];

internalField   uniform $U0;

boundaryField
{
    lower
    {
        type            uniformFixedValue;
        uniformValue    constant ( 0 0 0 );
        value           uniform ( 0 0 0 );
    }

    upper
    {
        type            slip;
    }

    #include "include/sidePatches"
}


// ************************************************************************* //
