CNBL/0/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       volScalarField;
    location    "0";
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include "../setUp"

dimensions      [ 0 2 -2 0 0 0 0 ];

internalField   uniform $p_rgh0;

boundaryField
{
    lower
    {
        type            fixedFluxPressure;
    }

    upper
    {
        type            fixedFluxPressure;
    }

    #include "include/sidePatches"
}


// ************************************************************************* //
