CNBL/0/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       volScalarField;
    location    "0";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include "../setUp"

dimensions      [0 0 0 1 0 0 0];

internalField   uniform $T0;

boundaryField
{
    lower
    {
        type            zeroGradient;
    }
    upper
    {
        type            fixedGradient;
    	gradient	    uniform $TGradUpper;
    }

    #include "include/sidePatches"
}


// ************************************************************************* //
                                                                                            
