CNBL/0/include/sidePatches
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/

west
{
    type            cyclic;
}
east
{
    type            cyclic;
}
north
{
    type            cyclic;
}
south
{
    type            cyclic;
}

// ************************************************************************* //
