CNBL/0/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       volScalarField;
    location    "0";
    object      kappat;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include "../setUp"

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform $nut0;

boundaryField
{
    lower
    {
        type            nutkAtmRoughWallFunction;
        z0              uniform $z0;
        value           uniform 0.0;
    }

    upper
    {
        type            slip;
    }

    #include "include/sidePatches"
}


// ************************************************************************* //
                                                                                            
