CNBL/0/qwall
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       volVectorField;
    location    "0";
    object      qwall;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 1 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    lower
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

    upper
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

    #include "include/sidePatches"
}


// ************************************************************************* //
