CNBL/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p_rgh
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-8;
        relTol          0.01;
    }

    p_rghFinal
    {
        $p_rgh;
        relTol          0.01;
    }

    "(U|T|k|epsilon)"
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-8;
        relTol          0.1;
        maxIter        2000; 
    }

    "(U|T|k|epsilon)Final"
    {
        $U;
        tolerance       1e-8;
        relTol          0;
        maxiter      2000;
    }
}

SIMPLE
{
    residualControl
    {
        p_rgh                1e-5;
        U                    1e-5;
        T                    1e-5;
        "(k|omega|epsilon)"  1e-5;
    }
    nNonOrthogonalCorrectors 0;
    pRefCell        0;
    pRefValue       0;

}

relaxationFactors
{
    fields
    {
        p_rgh                 0.3;
    }
    equations
    {
        U                     0.7;
        T                     0.7;
        "(k|omega|epsilon).*" 0.7;
    }
}


// ************************************************************************* //

